Revit 2026 API

# FilterableValueProvider Class

---

Defines the interface for classes that extract values from elements in a Revit project for testing against filter rules.

SystemObject Autodesk.Revit.DBFilterableValueProvider Autodesk.Revit.DBParameterValueProvider

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FilterableValueProvider : IDisposable
```
```vb
Public Class FilterableValueProvider
	Implements IDisposable
```
```cpp
public ref class FilterableValueProvider : IDisposable
```
```fsharp
type FilterableValueProvider =
    class
        interface IDisposable
    end
```

The FilterableValueProvider type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the FilterableValueProvider |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetAssociatedGlobalParameterValue | Gets a global parameter value associated with a parameter from the given element. |
|  | GetDoubleValue | Gets a double-precision numeric value from the given element. |
|  | GetElementIdValue | Gets an ElementId value from the given element. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetIntegerValue | Gets an integer value from the given element. |
|  | GetStringValue | Gets a string value from the given element. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsDoubleValueSupported | Determines whether the provide can provide a double-precision numeric value for the given element. |
|  | IsElementIdValueSupported | Determines whether the provide can provide an ElementId value for the given element. |
|  | IsIntegerValueSupported | Determines whether the provide can provide an integer value for the given element. |
|  | IsStringValueSupported | Determines whether the provide can provide a string value for the given element. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace